БИТУправление_медицинским_центром_демо/src/Documents/СписокНаПрохождениеМедосмотра/СписокНаПрохождениеМедосмотра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписокНаПрохождениеМедосмотра</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредседательМедКомиссии</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПредседателяМедКомиссии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительРаботодателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПредставителяРаботодателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключительногоАкта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполненияРекомендацийПредАкта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РекомендацииПоКомплексуОздоровительныхМероприятий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщЧисленностьРаботниковВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщЧисленностьРаботниковЖенщин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщЧисленностьРаботниковДо18Лет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщЧисленностьРаботниковУстУтратаНетрудоспособности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РаботникиНаТяжРаботахВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РаботникиНаТяжРаботахЖенщин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РаботникиНаТяжРаботахДо18Лет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РаботникиНаТяжРаботахУстУтратаНетрудоспособности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисленностьРаботниковОбязМедосмотрВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисленностьРаботниковОбязМедосмотрЖенщин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисленностьРаботниковОбязМедосмотрДо18Лет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисленностьРаботниковОбязМедосмотрУстУтратаНетрудоспособности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисленностьРаботниковПодлежМедосмотруВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисленностьРаботниковПодлежМедосмотруЖенщин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисленностьРаботниковПодлежМедосмотруДо18Лет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисленностьРаботниковПодлежМедосмотруУстУтратаНетрудоспособности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредыдущегоЗаключительногоАкта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействияМедосмотраФиксируютсяСметой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПолиса</name>
    <comment>Условия обслуживания по медосмотру в рамках договора с контрагентом</comment>
    <type>
      <types>CatalogRef.ВидыПолисов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьПриПечатиСметыДействияБезЦены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМО</name>
    <type>
      <types>CatalogRef.ВидыМедосмотров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Клиенты</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипМедосмотра</name>
      <type>
        <types>EnumRef.ТипыМедосмотров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаНеявки</name>
      <type>
        <types>CatalogRef.ПричиныНеявкиНаМедосмотр</types>
      </type>
    </attributes>
    <attributes>
      <name>ФИОКлиента</name>
      <comment>Копия реквизита на случай изменения в будущем в карточке клиента</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Профессия</name>
      <comment>Копия реквизита на случай изменения в будущем в карточке клиента</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦехУчасток</name>
      <comment>Копия реквизита на случай изменения в будущем в карточке клиента</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыполнениеРекомендаций</name>
    <attributes>
      <name>Мероприятие</name>
      <type>
        <types>EnumRef.МероприятияПоРезультатамМедосмотров</types>
      </type>
    </attributes>
    <attributes>
      <name>Подлежало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>CatalogRef.ДействияМедосмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/СписокНаПрохождениеМедосмотра/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	ПодписанЭП = Ложь;
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Новый алгоритм хранения вредных факторов клиента в ПМО
	Если ЗначениеЗаполнено(Ссылка) Тогда
		СсылкаСПМО = Ссылка;
	Иначе
		СсылкаСПМО = ПолучитьСсылкуНового();
		Если Не ЗначениеЗаполнено(СсылкаСПМО) Тогда
			УстановитьСсылкуНового(Документы.СписокНаПрохождениеМедосмотра.ПолучитьСсылку(Новый УникальныйИдентификатор));
			СсылкаСПМО = ПолучитьСсылкуНового();
		КонецЕсли;
	КонецЕсли;	
	Если Не (ДополнительныеСвойства.Свойство("НеВыполнятьСозданиеПМО") И ДополнительныеСвойства.НеВыполнятьСозданиеПМО) Тогда
		СоздатьИзменитьПрохожденияМОПередЗаписью(Отказ, СсылкаСПМО);
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьИзменитьПрохожденияМОПередЗаписью(Отказ, СсылкаСПМО)
	
	// Получаем выборку клиент-документ ПМО. Если был изменен приказ изменяем его и в ПМО
	// если не было ПМО, создаем новый
	
	// Перед записью изменяем уже имеющиеся ПМО, при записи создаем новые если требуется
	Запрос = Новый Запрос;
	Запрос.Текст =  
		"ВЫБРАТЬ
		|	&СсылкаСПМО КАК Ссылка,
		|	СписокНаПрохождениеМедосмотраКлиенты.НомерСтроки КАК НомерСтроки,
		|	СписокНаПрохождениеМедосмотраКлиенты.Клиент КАК Клиент,
		|	СписокНаПрохождениеМедосмотраКлиенты.ТипМедосмотра КАК ТипМедосмотра,
		|	СписокНаПрохождениеМедосмотраКлиенты.ПричинаНеявки КАК ПричинаНеявки,
		|	СписокНаПрохождениеМедосмотраКлиенты.ФИОКлиента КАК ФИОКлиента,
		|	СписокНаПрохождениеМедосмотраКлиенты.Профессия КАК Профессия,
		|	СписокНаПрохождениеМедосмотраКлиенты.ЦехУчасток КАК ЦехУчасток
		|ПОМЕСТИТЬ СписокНаПрохождениеМедосмотраКлиенты
		|ИЗ
		|	&Клиенты КАК СписокНаПрохождениеМедосмотраКлиенты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокНаПрохождениеМедосмотраКлиенты.Клиент КАК Клиент,
		|	СписокНаПрохождениеМедосмотраКлиенты.Ссылка КАК СПМО,
		|	&Филиал КАК Филиал,
		|	СписокНаПрохождениеМедосмотраКлиенты.Профессия КАК Профессия,
		|	СписокНаПрохождениеМедосмотраКлиенты.ЦехУчасток КАК ЦехУчасток,
		|	СписокНаПрохождениеМедосмотраКлиенты.ФИОКлиента КАК ФИОКлиента,
		|	СписокНаПрохождениеМедосмотраКлиенты.ТипМедосмотра КАК ТипМедосмотра,
		|	&ВидМО КАК ВидМО,
		|	ПрохождениеМедосмотра.Ссылка КАК СсылкаПМО,
		|	СписокНаПрохождениеМедосмотраКлиенты.ПричинаНеявки КАК ПричинаНеявки
		|ИЗ
		|	СписокНаПрохождениеМедосмотраКлиенты КАК СписокНаПрохождениеМедосмотраКлиенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрохождениеМедосмотра КАК ПрохождениеМедосмотра
		|		ПО СписокНаПрохождениеМедосмотраКлиенты.Ссылка = ПрохождениеМедосмотра.СписокНаПрохождениеМедосмотра
		|			И СписокНаПрохождениеМедосмотраКлиенты.Клиент = ПрохождениеМедосмотра.Клиент";
	
	Запрос.УстановитьПараметр("Клиенты", Клиенты.Выгрузить());
	Запрос.УстановитьПараметр("ВидМО", ВидМО);
	Запрос.УстановитьПараметр("СсылкаСПМО", СсылкаСПМО);
	Запрос.УстановитьПараметр("Филиал", Филиал);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	ОбработанныеДокументы = Новый Массив;
	ИзмененныеДокументы = Новый Массив;
	НеобходимоСоздать = Новый Массив;
	
	Для Каждого Эл Из Выгрузка Цикл
		СсылкаПМО = Эл.СсылкаПМО;
		Если ЗначениеЗаполнено(Эл.СсылкаПМО) Тогда 
			ОбъектПМО = СсылкаПМО.ПолучитьОбъект();
			ТребуетсяЗапись = Ложь;
			
			Если ОбъектПМО.ПометкаУдаления Тогда
				ОбъектПМО.ПометкаУдаления = Ложь;
				Если ЗначениеЗаполнено(ОбъектПМО.ДатаЗавершения) Тогда
					// Фактически не возможно, но гепотетически может быть все
					Продолжить;
				КонецЕсли;
				ТребуетсяЗапись = Истина;
			КонецЕсли;
			
			Если ОбъектПМО.ВидМО <> ВидМО Тогда 
				ОбъектПМО.ВидМО = ВидМО;
				ТребуетсяЗапись = Истина;
				Если ЗначениеЗаполнено(ОбъектПМО.ДатаЗавершения) Тогда
					Отказ = Истина;
					ТекстСообщения = "Невозможно изменить вид медосмотра, т.к. " 
									+ Строка(ОбъектПМО.Ссылка)
									+ " завершено с другим видом медосмотра";
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
			Если ТребуетсяЗапись Тогда
				Документы.ПрохождениеМедосмотра.УбратьЛишниеВредности(ОбъектПМО.ФакторыИУсловияРаботы, ОбъектПМО.ВидМО);
				ОбъектПМО.Записать();
				ИзмененныеДокументы.Добавить(ОбъектПМО.Ссылка);
			КонецЕсли;
			
			ОбработанныеДокументы.Добавить(СсылкаПМО);
		Иначе
			НеобходимоСоздать.Добавить(Эл);
		КонецЕсли;
	КонецЦикла;
	
	ДополнительныеСвойства.Вставить("НеобходимоСоздать", НеобходимоСоздать);
	ДополнительныеСвойства.Вставить("ОбработанныеДокументы", ОбработанныеДокументы);
	ДополнительныеСвойства.Вставить("ИзмененныеДокументы", ИзмененныеДокументы);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не (ДополнительныеСвойства.Свойство("НеВыполнятьСозданиеПМО") И ДополнительныеСвойства.НеВыполнятьСозданиеПМО) Тогда
		СоздатьИзменитьПрохожденияМОПриЗаписи();
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьИзменитьПрохожденияМОПриЗаписи()
	
	Для Каждого Эл Из ДополнительныеСвойства.НеобходимоСоздать Цикл
		Если ЗначениеЗаполнено(Эл.ПричинаНеявки) Тогда
			Продолжить;
		КонецЕсли;
		
		ПоляДокумента = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Эл);
		ПоляДокумента.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
		Если ДополнительныеСвойства.Свойство("НеВыполнятьЗаполнениеВФ") Тогда
			ПоляДокумента.Вставить("НеВыполнятьЗаполнениеВФ", ДополнительныеСвойства.НеВыполнятьЗаполнениеВФ);
		КонецЕсли;
		
		СсылкаПМО = Документы.ПрохождениеМедосмотра.СоздатьПрохождениеМедосмотра(ПоляДокумента);
		ДополнительныеСвойства.ОбработанныеДокументы.Добавить(СсылкаПМО);
	КонецЦикла;
	
	// Не обработанные на предыдущем шаге ПМО, пометим на удаление, т.к. их уже не имеется в данном списке 
	// (Например удалили Клиента из ПМО)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрохождениеМедосмотра.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПрохождениеМедосмотра КАК ПрохождениеМедосмотра
	|ГДЕ
	|	НЕ ПрохождениеМедосмотра.Ссылка В (&СписокОбработанныхПМО)
	|	И ПрохождениеМедосмотра.ПометкаУдаления = ЛОЖЬ
	|	И ПрохождениеМедосмотра.Проведен = ЛОЖЬ
	|	И ПрохождениеМедосмотра.СписокНаПрохождениеМедосмотра = &СписокНаПрохождениеМедосмотра";
	
	Запрос.УстановитьПараметр("СписокОбработанныхПМО", ДополнительныеСвойства.ОбработанныеДокументы);
	Запрос.УстановитьПараметр("СписокНаПрохождениеМедосмотра", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбъектПМО = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектПМО.УстановитьПометкуУдаления(Истина);
		ДополнительныеСвойства.ИзмененныеДокументы.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	ДополнительныеСвойства.Удалить("НеобходимоСоздать");
	ДополнительныеСвойства.Удалить("ОбработанныеДокументы");
	
КонецПроцедуры

#КонецОбласти
